{
  "nbformat": 4,
  "nbformat_minor": 0,
  "metadata": {
    "colab": {
      "provenance": [],
      "authorship_tag": "ABX9TyNZDqL3+zVIyUzlBS+QzQMe"
    },
    "kernelspec": {
      "name": "python3",
      "display_name": "Python 3"
    },
    "language_info": {
      "name": "python"
    }
  },
  "cells": [
    {
      "cell_type": "markdown",
      "source": [
        "Задача 22: Даны два неупорядоченных набора целых чисел (может быть, с повторениями). Выдать без повторений в порядке возрастания все те числа, которые встречаются в обоих наборах.\n",
        "Пользователь вводит 2 числа. n - кол-во элементов первого множества. m - кол-во элементов второго множества. Затем пользователь вводит сами элементы множеств."
      ],
      "metadata": {
        "id": "41kiS2hYXIFd"
      }
    },
    {
      "cell_type": "code",
      "execution_count": 18,
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "cv_7xXc-XEPO",
        "outputId": "c47d9503-1814-4a96-e3ce-1a1fd8d9ce74"
      },
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Введите длину 1го набора чисел: 23\n",
            "Введите длину 2го набора чисел: 26\n",
            "Первый набор чисел: [16, 7, 9, 11, 18, 18, 7, 2, 1, 13, 3, 0, 15, 15, 11, 12, 11, 5, 0, 18, 15, 9, 12]\n",
            "Второй набор чисел: [1, 15, 9, 17, 10, 0, 16, 2, 8, 6, 6, 12, 11, 0, 0, 10, 20, 14, 0, 7, 0, 6, 14, 18, 0, 14]\n",
            "Множество первого набора: {0, 1, 2, 3, 5, 7, 9, 11, 12, 13, 15, 16, 18}\n",
            "Множество второго набора: {0, 1, 2, 6, 7, 8, 9, 10, 11, 12, 14, 15, 16, 17, 18, 20}\n",
            "Множество значений имеющиеся в обоих наборах: [0, 1, 2, 7, 9, 11, 12, 15, 16, 18]\n"
          ]
        }
      ],
      "source": [
        "import random\n",
        "n1 = int(input('Введите длину 1го набора чисел: '))\n",
        "n2 = int(input('Введите длину 2го набора чисел: '))\n",
        "lst1 = [random.randint(0,20) for i in range(n1)]\n",
        "lst2 = [random.randint(0,20) for i in range(n2)]\n",
        "mng1 = set(lst1)\n",
        "mng2 = set(lst2)\n",
        "union_mng = mng1.intersection(mng2)\n",
        "print(f'Первый набор чисел: {lst1}')\n",
        "print(f'Второй набор чисел: {lst2}')\n",
        "print(f'Множество первого набора: {mng1}')\n",
        "print(f'Множество второго набора: {mng2}')\n",
        "print(f'Множество значений имеющиеся в обоих наборах: {sorted(union_mng)}')"
      ]
    },
    {
      "cell_type": "markdown",
      "source": [
        "Задача 24: В фермерском хозяйстве в Карелии выращивают чернику. Она растет на круглой грядке, причем кусты высажены только по окружности. Таким образом, у каждого куста есть ровно два соседних. Всего на грядке растет N кустов.\n",
        "Эти кусты обладают разной урожайностью, поэтому ко времени сбора на них выросло различное число ягод – на i-ом кусте выросло РАНДОМНОЕ колличество ягод.\n",
        "В этом фермерском хозяйстве внедрена система автоматического сбора черники. Эта система состоит из управляющего модуля и нескольких собирающих модулей. Собирающий модуль за один заход, находясь непосредственно перед некоторым кустом, собирает ягоды с этого куста и с двух соседних с ним.\n",
        "Напишите программу для нахождения максимального числа ягод, которое может собрать за один заход собирающий модуль, находясь перед некоторым кустом заданной во входном файле грядки."
      ],
      "metadata": {
        "id": "3Xz00bGnXK3s"
      }
    },
    {
      "cell_type": "code",
      "source": [
        "import random\n",
        "n1 = int(input('Введите количество кустов: '))\n",
        "lst1 = [random.randint(0,20) for i in range(n1)]\n",
        "print(f'Список кустов с ягодами: {lst1}')\n",
        "harvest_list = [(lst1[i] + lst1[(i + 1) % 6] + lst1[i - 1]) for i in range(n1)]\n",
        "print(f'Сколько сможем собрать с куста и соседних к нему: {harvest_list}')\n",
        "print(f'Максимально получится собрать: {max(harvest_list)}')\n",
        "print(f'Индекс куста с которого(+соседних) можно собрать максимум: {harvest_list.index(max(harvest_list))}')"
      ],
      "metadata": {
        "colab": {
          "base_uri": "https://localhost:8080/"
        },
        "id": "zFRyOv6GcWsW",
        "outputId": "4814e1d8-34e5-4756-d147-36f3a4d7e4f1"
      },
      "execution_count": 25,
      "outputs": [
        {
          "output_type": "stream",
          "name": "stdout",
          "text": [
            "Введите количество кустов: 12\n",
            "Список кустов с ягодами: [18, 20, 19, 19, 13, 6, 12, 9, 20, 19, 15, 3]\n",
            "Сколько сможем собрать с куста и соседних к нему: [41, 57, 58, 51, 38, 37, 38, 40, 48, 52, 40, 36]\n",
            "Максимально получится собрать: 58\n",
            "Индекс куста с которого(+соседних) можно собрать максимум: 2\n"
          ]
        }
      ]
    }
  ]
}
